<a href="https://colab.research.google.com/github/anapmdm/Intro-ao-Pandas/blob/main/Criando_um_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Criando um DataFrame a partir de um dicionario**

O pandas lê arquivos dataframe com .csv, no entanto vamos criar um usando dados 
do tipo *dict* e convertendo em dataframe.

In [1]:
#importando o pandas
import pandas as pd

In [3]:
#criando dicionario
#Em várias linhas para não ficar confuso
#Atentar para os : fora de '' e virgula no final
#CADA LINHDA DE DADOS VIRA UMA COLUNA
dados = {
    'nome':['Ana', 'Guilherme', 'João', 'Rosi', 'Alexandre'],
    'idade':[29, 31,21,53,60],
    'cidade':['Amsterdam','Velden','Massachusetts', 'Londres', 'Atenas' ],
    'comprou': [True, False, False, True, False]
}

In [4]:
#criando dataframe
df=pd.DataFrame(dados)

In [5]:
#Visualizando o dataframe
df

        nome  idade         cidade  comprou
0        Ana     29      Amsterdam     True
1  Guilherme     31         Velden    False
2       João     21  Massachusetts    False
3       Rosi     53        Londres     True
4  Alexandre     60         Atenas    False

In [6]:
#Criando ID de usuario
id_usuario = [123,124,125,126,127]

In [8]:
#Associando o id do usuario a lista
df.index=id_usuario

In [9]:
#verificar o df
df

          nome  idade         cidade  comprou
123        Ana     29      Amsterdam     True
124  Guilherme     31         Velden    False
125       João     21  Massachusetts    False
126       Rosi     53        Londres     True
127  Alexandre     60         Atenas    False

In [10]:
#verificando dados de usuario
df.loc[125]

nome                João
idade                 21
cidade     Massachusetts
comprou            False
Name: 125, dtype: object

**DataFrame a partir de Listas**
Para facilitar a conversão de listas para DF será usado **função built-in zip().**

In [22]:
#listas
dados =[['Ana', 29,'Amsterdam', 'True'],
        ['Guilherme', 31, 'Velden', 'False'],
        ['João', 21, 'Massachusetts','False'],
        ['Rosi', 53,'Londres', 'True'],
        ['Alexandre', 53, 'Atenas', 'False']]

#Criando DataFrame
df = pd.DataFrame(dados,columns=['nome','idade','cidade', 'comprou'],
index=['a','b','c','d','e'])

In [23]:
df

        nome  idade         cidade comprou
a        Ana     29      Amsterdam    True
b  Guilherme     31         Velden   False
c       João     21  Massachusetts   False
d       Rosi     53        Londres    True
e  Alexandre     53         Atenas   False

In [25]:
#selecionando pelo index
df.loc['a']

nome             Ana
idade             29
cidade     Amsterdam
comprou         True
Name: a, dtype: object

**CRIANDO NOVAS COLUNAS**

In [26]:
#Criando coluna de saldo
df['saldo']=0.0
df

        nome  idade         cidade comprou  saldo
a        Ana     29      Amsterdam    True    0.0
b  Guilherme     31         Velden   False    0.0
c       João     21  Massachusetts   False    0.0
d       Rosi     53        Londres    True    0.0
e  Alexandre     53         Atenas   False    0.0

**MODIFICANDO INDEX E COLUNAS**

In [29]:
df.index = ['A', 'B', 'C', 'D', 'E']
df

        nome  idade         cidade comprou  saldo
A        Ana     29      Amsterdam    True    0.0
B  Guilherme     31         Velden   False    0.0
C       João     21  Massachusetts   False    0.0
D       Rosi     53        Londres    True    0.0
E  Alexandre     53         Atenas   False    0.0

In [32]:
#Alterando colunas
df.columns=['Nome', 'Idade', 'Cidade', 'Fez compras', 'Saldo da Loja']
df

        Nome  Idade         Cidade Fez compras  Saldo da Loja
A        Ana     29      Amsterdam        True            0.0
B  Guilherme     31         Velden       False            0.0
C       João     21  Massachusetts       False            0.0
D       Rosi     53        Londres        True            0.0
E  Alexandre     53         Atenas       False            0.0